app/views/devise/registrations/new.html.erb

SELECT "roles".* FROM "roles"
---
    <%= f.label :role %><br />
    <%= select(:user, :role_id, Role.all.map {|r| [r.name, r.id] }) %>