app/controllers/appointments_controller.rb

  def index
    @appointments = @pet.blank? ? Appointment.all : @pet.appointments
    @appointments = @appointments.where(
      doctor_id: current_user.id) if current_user.doctor?
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."pet_id" = $1  [["pet_id", 5]]
SELECT "appointments".* FROM "appointments" WHERE "appointments"."pet_id" = $1 AND "appointments"."doctor_id" = $2  [["pet_id", 5], ["doctor_id", 5]]

  def create
    @appointment = Appointment.new(appointment_params)

    respond_to do |format|
      if @appointment.save
---
INSERT INTO "appointments" ("reason", "required_reminder", "pet_id", "customer_id", "doctor_id", "visit_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    respond_to do |format|
      if @appointment.update(appointment_params)
---
UPDATE "appointments" SET "visit_date" = $1, "updated_at" = $2 WHERE "appointments"."id" = $3  [["visit_date", "2015-03-10 03:10:00.000000"], ["updated_at", "2015-03-09 03:13:41.804544"], ["id", 1]]