app/controllers/pets_controller.rb

SELECT "pets".* FROM "pets" WHERE "pets"."user_id" = $1  [["user_id", 6]]
---
  def index
    @user_id = current_user.customer? ? current_user.id : params[:user_id]
    @user_id = @user_id || current_user.id
    @pets = Pet.where(user_id: @user_id)

INSERT INTO "pets" ("name", "pet_type", "breed", "age", "weight", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["name", "Pet1"], ["pet_type", "dog"], ["breed", "Laberdor"], ["age", 2], ["weight", 12], ["user_id", 4], ["created_at", "2015-03-09 02:30:59.558773"], ["updated_at", "2015-03-09 02:30:59.558773"]]
---
  def create
    @pet = Pet.new(pet_params)

    respond_to do |format|
      if @pet.save

UPDATE "pets" SET "age" = $1, "updated_at" = $2 WHERE "pets"."id" = $3  [["age", 3], ["updated_at", "2015-03-09 02:42:18.792418"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @pet.update(pet_params)

DELETE FROM "pets" WHERE "pets"."id" = $1  [["id", 3]]
---
  def destroy
    user_id = @pet.user_id
    @pet.destroy