app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = current_user.customer? ? [current_user] : User.all